hyansuper/xiaozhi_chat/example/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_SR_WN_WN9S_NIHAOXIAOZHI=y
CONFIG_GMF_AUDIO_CODEC_DECODER_TYPE_RAW_OPUS=y
CONFIG_GMF_AUDIO_CODEC_DEC_OPUS_SAMPLE_RATE_24K=y
CONFIG_GMF_AUDIO_CODEC_DEC_OPUS_CHANNEL=1
CONFIG_GMF_AUDIO_CODEC_ENCODER_TYPE_OPUS=y
CONFIG_GMF_AUDIO_CODEC_ENC_OPUS_SAMPLE_RATE_24K=y
CONFIG_GMF_AUDIO_CODEC_ENC_OPUS_CHANNEL=1
CONFIG_GMF_AUDIO_CODEC_ENC_OPUS_FRAME_DURATION_60_MS=y
CONFIG_GMF_AUDIO_CODEC_ENC_OPUS_ENABLE_DTX=y
CONFIG_GMF_AUDIO_CODEC_ENC_OPUS_ENABLE_VBR=y
CONFIG_GMF_AUDIO_EFFECT_CH_CVT_DEST_CH=1
CONFIG_GMF_AUDIO_EFFECT_RATE_CVT_DEST_RATE=24000
CONFIG_GMF_AI_AUDIO_INIT_AEC=n
CONFIG_GMF_AI_AUDIO_INIT_WN=y
CONFIG_GMF_AI_AUDIO_WN_CH_ALLOCATION="M"
CONFIG_GMF_AI_AUDIO_INIT_AFE=y
CONFIG_GMF_AI_AUDIO_AFE_CH_ALLOCATION="M"
CONFIG_GMF_AI_AUDIO_WAKEUP_ENABLE=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_FREERTOS_HZ=1000
CONFIG_AUDIO_SIMPLE_PLAYER_RESAMPLE_DEST_RATE=24000
CONFIG_ESP_AUDIO_SIMPLE_PLAYER_BIT_CVT_EN=y
CONFIG_CODEC_ES7210_SUPPORT=n
CONFIG_CODEC_ES7243_SUPPORT=n
CONFIG_CODEC_ES7243E_SUPPORT=n
CONFIG_CODEC_ES8156_SUPPORT=n
CONFIG_CODEC_AW88298_SUPPORT=n
CONFIG_CODEC_ES8389_SUPPORT=n
CONFIG_CODEC_ES8374_SUPPORT=n
CONFIG_CODEC_ES8388_SUPPORT=n
CONFIG_CODEC_TAS5805M_SUPPORT=n
CONFIG_VIDEO_DECODER_SW_H264_SUPPORT=n
CONFIG_VIDEO_DECODER_SW_MJPEG_SUPPORT=n
CONFIG_VIDEO_ENCODER_SW_H264_SUPPORT=n
CONFIG_VIDEO_ENCODER_SW_MJPEG_SUPPORT=n
